package Task3.naive;

import Task3.Constants;
import Task3.Fork;
import Task3.Philosopher;
import Task3.Starter;
import java.util.List;
import java.util.stream.Collectors;
import java.util.stream.IntStream;

public class NaiveStart extends Starter {

  @Override
  protected List<? extends Philosopher> setPhilosophers(List<Fork> forks) {
    return IntStream
      .range(0, Constants.PHILOSOPHERS_AMOUNT)
      .mapToObj(
        i ->
          new NaivePhilosopher(
            i,
            Constants.names[i],
            forks.get(i),
            forks.get((i + 1) % forks.size())
          )
      )
      .collect(Collectors.toList());
  }

  @Override
  protected void stopProcesses(List<Thread> threads) {
    stopThreads(threads);
  }
}
/*
================================== (1) ====================================
---------------------------------------------------------------------------
Дана реалізація обіду 5-ти філософів небезпечна виникненням deadlock-у,
коли кожен філософ візьме одночасно ліву вилку, тоді кожен буде очікувати
на звільнення правою, а цієї події ніколи не станеться і філософи будуть у
вічному очікуванні, голодні, без філософських мислів. Виникнення проблеми
продемонстровано далі:
---------------------------------------------------------------------------
1703750890343700: Початок вечері
1703750901076100: Платон[0] думає...
1703750901443400: Конфуцій[1] думає...
1703750909181100: Спіноза[2] думає...
1703750909324200: Декарт[3] думає...
1703750909387600: Сократ[4] думає...
1703750909476400: Вилку 0 взяли
1703750912544600: Вилку 2 взяли
1703750909577200: Вилку 1 взяли
1703750914507800: Вилку 4 взяли
1703750912678400: Вилку 3 взяли
1703755015831500: Кінець вечері
Платон[0] поїв 0 разів.
Конфуцій[1] поїв 0 разів.
Спіноза[2] поїв 0 разів.
Декарт[3] поїв 0 разів.
Сократ[4] поїв 0 разів.

*/
/*
================================== (2) ====================================
---------------------------------------------------------------------------
Виставлення пріорітетів не вирішує проблему deadlock-у,
а тільки допомагає обійти виникнення даної проблеми на самому початку
запуску, можна помітити, що філософи з нижчим пріорітетом їли значно менше.
---------------------------------------------------------------------------

1711415705022600: Початок вечері
1711415716732500: Платон[0] думає...
1711415717721300: Спіноза[2] думає...
1711415717976000: Конфуцій[1] думає...
1711415726531500: Вилку 0 взяли
1711415727115100: Вилку 2 взяли
1711415732014000: Вилку 1 взяли
1711415732060100: Вилку 3 взяли
1711415732104200: Платон[0] їсть.
1711415732138100: Спіноза[2] їсть.
1711415732367300: Вилку 1 поклали
1711415732376700: Вилку 3 поклали
1711415732576100: Вилку 2 поклали
1711415732609700: Спіноза[2] думає...
1711415732567000: Вилку 0 поклали
1711415732677900: Платон[0] думає...
1711415732665700: Вилку 2 взяли
1711415732743000: Вилку 3 взяли
1711415732772200: Спіноза[2] їсть.
1711415732733100: Вилку 0 взяли
..............................
..............................
1711415788813100: Вилку 3 поклали
1711415788819000: Вилку 4 взяли
1711415788826700: Вилку 3 взяли
1711415788830100: Спіноза[2] їсть.
1711415788836500: Декарт[3] думає...
1711415788841400: Вилку 3 поклали
1711415788847400: Вилку 2 поклали
1711415788851900: Спіноза[2] думає...
1711415788856400: Вилку 3 взяли
1711415788861400: Вилку 2 взяли
1711420832275500: Кінець вечері
--------------------
Статистика вечері:
Загалом: 4614
Філософ Платон[0]: 33.982661465106197%
Філософ Конфуцій[1]: 10.00433463372345%
Філософ Спіноза[2]: 10.00433463372345%
Філософ Декарт[3]: 34.0260078023407%
Філософ Сократ[4]: 7.982661465106197%

*/
